Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.Offset Constructor
 Initializes a new instance of the RebarSpacing.Offset struct.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Offset(
	bool automatic,
	double distance
)
Public Sub New (
	automatic As Boolean,
	distance As Double
)
Parameters
automatic
Type: System.Boolean
Whether or not the offset should be calculated automatically.
distance
Type: System.Double
The distance.
See Also
Reference
RebarSpacing.Offset Structure
Tekla.Structures.Model Namespace